app/Controllers/Admin.php

    public function course_screen()
    {
        $session = session();
        if ($session->has('admin_in') || $session->get('admin_in') === true) {
            $this->setHeaders();
            $courseModel = new \App\Models\CourseModel();
            $data['courses'] = $courseModel->findAll();
---
SELECT *
FROM `course`