app/Controllers/Chat.php

            'jenis' => $jenis,
            'pesan' => $pesan
        ];
        if ($chatModel->insert($chat)) {
---
INSERT INTO `chat` (`id_pengirim`, `id_penerima`, `jenis`, `pesan`) VALUES ('13', '17', 'teks', 'halo')