app/Controllers/Dokter.php

SELECT COUNT(*) AS `numrows`
FROM `user`
WHERE `role` = 'pasien'
---
    public function index()
    {
        $dokterModel = new DokterModel();
        $userModel = new UserModel();

        $idUser = session()->get('id_user');
        $username = session()->get('username');
        $userData = $userModel->getData($username);
        $dokterData = $dokterModel->getDataID($idUser);
        $data = [
            "nama" => $userData["nama"],
            "email" => $userData["email"],
            "foto" => $userData["foto"],
            "jumlah_pasien" => $userModel->where('role', 'pasien')->countAllResults()
        ];

SELECT *
FROM `dosis_obat`
WHERE `id_riwayat` = '3'
---
    public function medical_history_data()
    {
        $pasienModel = new PasienModel();
        $riwayatModel = new RiwayatMedisModel();
        $dosisModel = new DosisObatModel();

        // Ambil data id dan nama pasien
        $dataPasien = $pasienModel->getPatients();

        // Siapkan array untuk menyimpan riwayat dan dosis obat terkait
        $dataPasienWithDetails = [];

        // Looping untuk setiap pasien
        foreach ($dataPasien as $pasien) {
            $id_pasien = $pasien['id'];

            // Ambil semua data riwayat berdasarkan id pasien
            $riwayat = $riwayatModel->getDataID($id_pasien);

            // Array untuk menyimpan data riwayat beserta dosis obat terkait
            $riwayatWithDosis = [];

            foreach ($riwayat as $r) {
                // Ambil dosis obat berdasarkan id riwayat
                $dosis = $dosisModel->where('id_riwayat', $r['id'])->findAll();