app/Controllers/Pasien.php

SELECT *
FROM `course`
SELECT *
FROM `course_progress`
WHERE `id_user` = '44'
---
    public function index()
    {
        $pasienModel = new PasienModel();
        $userModel = new UserModel();
        $courseModel = new \App\Models\CourseModel();
        $statModel = new StatCourseModel();
        $courseProgressModel = new CourseProgressModel();

        $idUser = session()->get('id_user');
        $username = session()->get('username');


        if ($pasienModel->getDataID($idUser) === null) {
            return redirect()->to('login/logout');
        }

        $userData = $userModel->getData($username);
        $pasienData = $pasienModel->getDataID($idUser);
        $statData = $statModel->getData($pasienData["id"]);
        $courses = $courseModel->findAll();
        $courseProgress = $courseProgressModel->where('id_user', $userData["id"])->findAll();