app/Controllers/Posttest.php

    public function submit()
<<<<<<< HEAD
{
    $pasienModel = new PasienModel();
    $hasilModel = new \App\Models\HasilPosttestModel(); // Panggil model hasil posttest
    $jawabanModel = new \App\Models\AnsPosttestModel(); // Model untuk menyimpan jawaban posttest

    $selectedOptions = $this->request->getPost('pilihan');
    $id_user = session()->get('id_user'); // Ambil ID pasien dari sesi
    $id_pasien = $pasienModel->getDataID($id_user)["id"];

    // Ambil data pertanyaan dan pilihan ganda
    $pertanyaan = $this->posttestModel->findAll();
---
SELECT *
FROM `posttest`