app/Models/AdminModel.php

    public function getData($username)
    {
        return $this->where('username', $username)->first();
---
SELECT *
FROM `admin`
WHERE `username` = 'admin'
 LIMIT 1

    public function cekUser($username)
    {
        return $this->where('username', $username)->first() === null;
---
SELECT *
FROM `admin`
WHERE `username` = 'admin'
 LIMIT 1