app/Models/DokterModel.php

    public function getDataID($id_user)
    {
        return $this->where('id_user', $id_user)->first();
---
SELECT *
FROM `dokter`
WHERE `id_user` = '24'
 LIMIT 1

    public function getAllDoctors()
    {
        return $this->select('dokter.*, user.id, user.nama, user.gender, user.usia, user.no_hp, user.email, user.username')
            ->join('user', 'user.id = dokter.id_user')
            ->where('user.role', 'dokter')
            ->findAll();
---
SELECT `dokter`.*, `user`.`id`, `user`.`nama`, `user`.`gender`, `user`.`usia`, `user`.`no_hp`, `user`.`email`, `user`.`username`, `user`.`foto`
FROM `dokter`
JOIN `user` ON `user`.`id` = `dokter`.`id_user`
WHERE `user`.`role` = 'dokter'