app/Models/PasienModel.php

    public function getDataID($id_user)
    {
        return $this->where('id_user', $id_user)->first();
---
SELECT *
FROM `pasien`
WHERE `id_user` = '44'
 LIMIT 1

    public function getPatients()
    {
        return $this->select('pasien.id, user.nama')
            ->join('user', 'user.id = pasien.id_user')
            ->where('user.role', 'pasien')
            ->findAll();
---
SELECT `pasien`.`id`, `user`.`nama`
FROM `pasien`
JOIN `user` ON `user`.`id` = `pasien`.`id_user`
WHERE `user`.`role` = 'pasien'

    public function getPatient($id)
    {
        return $this->select('pasien.*, user.id, user.nama, user.gender, user.usia, user.no_hp, user.email, user.username, user.foto')
            ->join('user', 'user.id = pasien.id_user')
            ->where('user.role', 'pasien')
            ->where('pasien.id_user', $id)  // Tambahkan kondisi untuk mencocokkan id_user dengan $id
            ->findAll();
---
SELECT `pasien`.*, `user`.`id`, `user`.`nama`, `user`.`gender`, `user`.`usia`, `user`.`no_hp`, `user`.`email`, `user`.`username`, `user`.`foto`
FROM `pasien`
JOIN `user` ON `user`.`id` = `pasien`.`id_user`
WHERE `user`.`role` = 'pasien'
AND `pasien`.`id_user` = '13'