app/Models/UserModel.php

    public function getID($username)
    {
        return $this->where('username', $username)->first()['id'];
---
SELECT *
FROM `user`
WHERE `username` = 'ica'
 LIMIT 1

    public function cekUser($username)
    {
        return $this->where('username', $username)->first() === null;
---
SELECT *
FROM `user`
WHERE `username` = 'yosi'
 LIMIT 1

    public function getData($username)
    {
        return $this->where('username', $username)->first();
---
SELECT *
FROM `user`
WHERE `username` = 'kuda'
 LIMIT 1

    public function countDoctors()
    {
        return $this->where('role', 'dokter')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `user`
WHERE `role` = 'dokter'

    public function countPatients()
    {
        return $this->where('role', 'pasien')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `user`
WHERE `role` = 'pasien'